{
    "heading": "Tamil Nadu Eyes Leadership in Electronics Sector",
    "image": "news images/ashok_leyland.jpg",
    "paragraph": "Tamil Nadu has set ambitious goals for its electronics sector but still has significant progress to make in strengthening its component manufacturing ecosystem and increasing value addition, according to Industries Secretary Arun Roy. Speaking at the 14th edition of Source India - Electronics Supply Chain 2025, Roy highlighted Tamil Nadu’s leadership in electronics manufacturing while emphasizing the need for further development.\n\nTamil Nadu contributes nearly 20% of India’s total electronics output, with a substantial lead in certain segments. Approximately 32% of electronics consumer goods and 45% of computers and peripherals produced in India come from the state. Additionally, about 75% of the production of some premium phone brands occurs in Tamil Nadu, reinforcing its status as a major electronics hub.\n\nRoy noted that Tamil Nadu aims to establish itself as a key player in the semiconductor sector, particularly in design and packaging, which are high-value segments of the industry. He emphasized that electronics is one of the fastest-growing industries in Tamil Nadu and a crucial driver of the state's economy. The sector's growth has been remarkable, surging from $1.6 billion in 2020-21 to $9.56 billion in 2023-24—an eightfold increase.\n\nAs Tamil Nadu works toward its vision of becoming a $1 trillion economy, Roy stated that the electronics industry is one of the champion sectors driving this growth. He called for greater collaboration within the industry to leverage Tamil Nadu’s existing industrial strengths, particularly in automobiles and electronics, to foster the development of auto-electronics. \n\nThe state government is keen to capitalize on its strong manufacturing ecosystem and promote the synergy between the electronics and automobile industries. With this strategy, the growth of auto-electronics in Tamil Nadu is expected to accelerate, further solidifying the state’s position as a leading industrial hub in India.",
    "video":"news-videos/Ashok Leyland _ The journey so far.mp4"
}
