{
    "heading": "Phoenix Kothari to Invest ₹5,000 Crore in Tamil Nadu",
    "image": "news images/phoenix.jpg",
    "paragraph": "Phoenix Kothari Footwear Ltd, a joint venture between Chennai-based Kothari Industrial Corporation Ltd. (KICL) and Taiwan’s Evervan Group, has announced a significant investment of ₹5,000 crore to establish non-leather footwear manufacturing factories in Eraiyur and Karur, Tamil Nadu. This initiative aims to strengthen Tamil Nadu’s position as a hub for footwear production and generate employment opportunities in the region.\n\nThe company is set to formalize the agreement by signing a Memorandum of Understanding (MoU) with Taiwan’s Shoetown on February 26, 2025, in the presence of Tamil Nadu Chief Minister M.K. Stalin. This partnership is expected to bring advanced manufacturing technology, global expertise, and enhanced production capacity to the state’s growing industrial sector.\n\nChairman of Phoenix Kothari Footwear Ltd, J Rafiq Ahmed, emphasized that the investment aligns with the Tamil Nadu government’s vision of boosting industrial development and attracting foreign direct investment. The non-leather footwear sector has been witnessing increasing global demand, and this investment aims to position Tamil Nadu as a key player in the international market.\n\nThe new factories will incorporate state-of-the-art technology, eco-friendly production methods, and high-quality manufacturing processes. These facilities are expected to create thousands of direct and indirect jobs, benefiting the local economy and contributing to skill development initiatives in the region.\n\nTamil Nadu has been actively promoting investments in various industries, including footwear, textiles, and electronics, as part of its broader economic growth strategy. The state government has assured necessary support in terms of infrastructure, logistics, and policy incentives to facilitate smooth execution of the project.\n\nIndustry experts believe that this venture will not only boost the region’s manufacturing capabilities but also enhance India’s position as a global exporter of non-leather footwear. The collaboration with Shoetown, a prominent Taiwanese footwear manufacturer, is expected to bring in advanced machinery, automation techniques, and global best practices to improve efficiency and product quality.\n\nThe upcoming signing ceremony will mark a major milestone in Tamil Nadu’s industrial expansion, reinforcing the state’s commitment to economic growth, innovation, and sustainable development. With the global footwear market shifting towards non-leather alternatives, Phoenix Kothari Footwear Ltd’s investment is strategically timed to capitalize on emerging trends and consumer preferences.\n\nAs the groundwork begins for these new factories, stakeholders are optimistic about the long-term impact of this initiative on the local economy, employment rates, and Tamil Nadu’s reputation as a leading industrial hub in India."
}
